# Вариант 5

## Задание 1
Нам данно две таблицы:
- (cубъект, год) -> потреблению электроэнергии
- (cубъект) -> округ

Требуется подсчитать суммарное потребление электроэнергии в 2009 году по округу Сибирский.

1. Сначала узнаем какие `cубъекты` входят в этот `округ` - это делает программа t1_1.cpp. 

    (!везде без лишних пробелов) \
    Формат входных данных:
    - первая строка: название `округа` для поиска
    - следующие строки: `cубъект,округ` или `cубъект,округ,`

    Печатает:
    - первая строка: количество подходящих `cубъектов`
    - далее на каждой новой строчке название `cубъекта`

    <details>

    <summary> Результат: </summary>
    
    ```
    12
    Алтайский край
    Иркутская область
    Кемеровская область
    Красноярский край
    Новосибирская область
    Омская область
    Республика Алтай
    Республика Бурятия
    Республика Тыва
    Республика Хакасия
    Томская область
    Читинская область
    ```
    </details>

2. Далее... 
    <details>

    <summary> Лог t1_2.cpp </summary>

    ```
    SEARCH:
    Алтайский край
    Иркутская область
    Кемеровская область
    Красноярский край
    Новосибирская область
    Омская область
    Республика Алтай
    Республика Бурятия
    Республика Тыва
    Республика Хакасия
    Томская область
    Читинская область

    [FIND] Республика Алтай : 512.9
    [FIND] Республика Бурятия : 4739.3
    [FIND] Республика Тыва : 669.8
    [FIND] Республика Хакасия : 17048.6
    [FIND] Алтайский край : 10005.4
    [FIND] Красноярский край : 49995.4
    [FIND] Иркутская область : 52409.7
    [FIND] Кемеровская область : 33020.5
    [FIND] Новосибирская область : 15192
    [FIND] Омская область : 10111
    [FIND] Томская область : 9642.6
    [FIND] Читинская область : 7429
    
    SUM: 210776.200000
    ```
    </details>

Ответ: 210776.2



## Задание 2

Нам данно (уже без C++ парсинга):
```
Субъект,1990,1995,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
Тульская область,15820.1,10952.5,10519.8,10600.4,10290.5,11470.0,10353.7,10265.2,10510.2,9953.1,9976.8,9120.7,9578.2
```

Запишем данные с 2000 по 2010 годы в массив:
```
vector<double> x = {10519.8, 10600.4, 10290.5, 11470.0, 10353.7, 10265.2, 10510.2, 9953.1, 9976.8, 9120.7, 9578.2};
```

1. Среднее значение: $x_{mean} = \sum\limits_{i=1}^n x_i / n$

2. Дисперсия: $\sum\limits_{i=1}^n (x_i - x_{mean})^2 / n$


<details>

<summary> Код </summary>

```cpp
#include <bits/stdc++.h>
using namespace std;

int main() {
    vector<double> x = {10519.8, 10600.4, 10290.5, 11470.0, 10353.7, 10265.2, 10510.2, 9953.1, 9976.8, 9120.7, 9578.2};
    int n = x.size();

    // 1. подсчёт среднего:
    double sum = 0;
    for(auto e : x) sum += e;
    double xx = sum/n;
    cout << "Mean: " << fixed << xx << endl;
    
    // 2. подсчёт дисперсии:
    double D = 0;
    for(auto e : x) D += (e-xx) * (e-xx);
    cout << "Dispersion: " << fixed << (D/n) << endl;
}
```
</details>

$\text{ }$


**Ответ:** \
Найдите среднее значение (ответ округлите до целых млн.кВт.час): $10240$. \
Найдите дисперсию (ответ округлите до целых млн.кВт.час): $332054$.



## Задание 3

Дан временной ряд:

$y =[51, 50, 37, 42, 55, 56, 53, 40, 46, 43, 59, 52, 48, 44, 65, 57, 62, 60, 61, 70, 63, 54, 64, 58, 71]$

Будем считать в решении что отсчёт начинается с $x = 1$.

1. Коэффициент линейного тренда, задаваемого уравнением вида $y= ax + b$:
    - $a = \dfrac{n \sum_i (x_i \cdot y_i) - (\sum_i x_i) \cdot (\sum_i y_i)}{n (\sum_i x_i^2) - (\sum_i x_i)^2}$
    - $b = \dfrac{(\sum_i y_i) - a \cdot (\sum_i x_i)}{n}$

2. Коэффициент детерминации $R^2$:
    - $R^2 = 1 - \dfrac{\sum_i (ax_i+b - y_i)^2}{\sum_i (y_{avg} - y_i)^2}$

<details>

<summary> Код </summary>

```cpp
#include <bits/stdc++.h>
using namespace std;

int main() {
    vector<int> Y = {51, 50, 37, 42, 55, 56, 53, 40, 46, 43, 59, 52, 48, 44, 65, 57, 62, 60, 61, 70, 63, 54, 64, 58, 71};
    int N = Y.size();
  
    // 1. Линейнй тренд
    long long sx = 0, sy = 0, sxy = 0, sxx = 0;
    for(int i = 0; i < N; i++) {
        int x = i+1, y = Y[i];
        sx += x; sy += y; sxy += x*y; sxx += x*x;
    }

    long double a = 1.* (N * sxy - sx*sy) / (N*sxx - sx*sx);
    long double b = (sy - a*sx) / N; 

    cout << "f = " << a << " *x + " << b << endl;

    // 2. Определите коэффициент детерминации R^2
    long double A = 0, B = 0, y_avg = 1.* sy/N;
    for(int i = 0; i < N; i++) {
        int x = i+1;
        A += (a*x+b - Y[i]) * (a*x+b - Y[i]);
        B += (y_avg - Y[i]) * (y_avg - Y[i]);
    }
    long double R2 = 1 - A/B;
    cout << "R^2: " << R2 << endl;
}
```
</details>

$\text{ }$

**Ответ:** \
Определите коэффициент $a$ линейного тренда, задаваемого уравнением вида $y= ax + b$. (округленное до сотых, десятичный разделитель — точка): $0.87$. \
Определите коэффициент детерминации $R^2$ для тренда. (округленное до тысячных, десятичный разделитель — точка): $0.481$.


## Задание 5
В таблице VISITOR содержатся сведения о посетителях музеев. Сколько среди них посетителей по имени `Борис`?

```
select count(*) from 
    (select distinct visitor_id from VISITOR where first_name = 'Борис') as ab
```

Ответ: $450$.


## Задание 6
В каком из упомянутых в базе музеев хранятся произведения `Михаил Перхин`? Сколько именно произведений?


Введите название музея ровно так, как оно хранится в базе данных:  

```
select distinct museum_name from museum natural join hall natural join exhibit where author = 'Михаил Перхин'
```

Ответ: Музей Фаберже.


Введите количество произведений
```
select count(*) from 
	(select distinct exhibit_id from museum natural join hall natural join exhibit where author = 'Михаил Перхин' ) as ab
```
Ответ: $5$.

## Задача 7
В базе данных хранятся сведения о произведениях некоторых авторов из нескольких музеев Санкт-Петербурга. Укажите название самого раннего произведения (из упомянутых в базе) автора `Генрик Вигстрём`?
Введите название произведения ровно так, как оно хранится в базе данных:

Запрос: `select * from museum` - показал что все музеи в Санкт-Петербурге.

```
SELECT year_of_creation, exhibit_name
FROM   museum natural join hall natural join exhibit where author = 'Генрик Вигстрём'
ORDER BY year_of_creation
LIMIT 1
```

(онако если посмотртеть все результаты то там окажется одно произведение с `year_of_creation is NULL`)

Ответ: Флакон парфюмерный с крышкой в виде женской головки.


